httpstorm/sdk-nrf/samples/nrf9160/protec3/src/main.c
/*
 * Copyright (c) 2016 Open-RnD Sp. z o.o.
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/kernel.h>
#include <stdio.h>
#include <zephyr/device.h>
#include <inttypes.h>
#include <string.h>
#include <nrf_modem.h>
#include <zephyr/sys/util.h>
#include <zephyr/sys/printk.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/eeprom.h>
#include <zephyr/drivers/sensor.h>
#include <zephyr/dfu/mcuboot.h>
#include <zephyr/net/socket.h>
#include <nrf_socket.h>
#include <nrf_modem_at.h>
#include <modem/modem_slm.h>

#include <adp536x-mod.h>
#include <buzzer.h>

#include <zephyr/data/json.h>

#include "gpio_t.h"
#include "fota_update.h"
#include "apn.h"
#include "aws.h"
#include "eeprom.h"
#include "uart.h"
#include "main.h"
#include "mqtt_handler.h"

#define MSG_SIZE 768
char msg[MSG_SIZE];

// must be at least sizeof(nmea_out)
#define MQTT_SIZE 256
char mqtt[MQTT_SIZE];


#if CONFIG_NETWORKING
int tcp_connect_disconnect(int connect);
ssize_t lte_send(const char * msg, size_t size);
#endif

#ifdef CONFIG_UPDATE_FILE
void fota_dl_init(void);
void fota_dl_trigger(void);

static const struct device * uart0_dev;
#endif

#if 1
int send_sms(const char * number, const char * msg, char * cmd_buf, size_t buf_len);
void bme280_init_api(const struct device * i2c_dev);
#endif

#if 1
#include "shtc3.h"
#endif

#if 1
#include "iis2dlpc.h"
#endif


LOG_MODULE_REGISTER(protec3, CONFIG_PROTEC3_LOG_LEVEL);


// EEPROM device
const struct device * eeprom_dev = NULL;

const struct gpio_struct button_node = PIN_INPUT(button);
const struct gpio_struct gps_en_node = PIN_OUTPUT(gps_enable);
const struct gpio_struct alarm_loud_node = PIN_OUTPUT(alarm_loud);
const struct gpio_struct rtc_node = PIN_INPUT(rtc_int);
const struct gpio_struct pir_node = PIN_INPUT(pir_int);
const struct gpio_struct pmic_node = PIN_INPUT(pmic_int);
const struct gpio_struct nrf52840_int_node = PIN_INPUT(nrf52840_int);

struct eeprom_apn_config apn_config;

static uint16_t beep_length[2] = { 100, 100 };
static bool loud_on = false;

const static struct device * pin_init(const struct gpio_struct * gpio)
{
	const struct device * gpio_dev;
	int ret;

	gpio_dev = gpio->gpio_dev;

	ret = gpio_pin_configure(gpio_dev, gpio->gpio_pin, gpio->gpio_flags);

	if (ret != 0)
	{
		printk("Error %d: failed to configure pin %d '%s'\n", ret, gpio->gpio_pin, gpio->gpio_pin_name);
		return NULL;
	}

	return gpio_dev;
}

const static struct device * pin_int_init(
	const struct gpio_struct * gpio,
	struct gpio_callback * cb_data,
	void (*cb_func)(const struct device *, struct gpio_callback *, uint32_t),
	gpio_flags_t flags
)
{
	const struct device * gpio_dev;
	int ret;

	gpio_dev = pin_init(gpio);

	if (gpio_dev == NULL)
	{
		return NULL;
	}

	ret = gpio_pin_interrupt_configure(
		gpio_dev,
		gpio->gpio_pin,
		flags ? flags : GPIO_INT_EDGE_TO_ACTIVE
	);

	if (ret != 0)
	{
		printk("Error %d: failed to configure interrupt on %s pin %d\n", ret, gpio->gpio_pin_name, gpio->gpio_pin);
		return NULL;
	}

	gpio_init_callback(cb_data, cb_func, BIT(gpio->gpio_pin));
	gpio_add_callback(gpio_dev, cb_data);

	printk("Set up button at %s pin %d\n", gpio->gpio_pin_name, gpio->gpio_pin);

	return gpio_dev;
}


volatile bool button_int_event = false;
volatile bool pir_int_event = false;
volatile bool nrf52840_int_level = false;

static struct gpio_callback button_cb_data;
static struct gpio_callback rtc_int_cb_data;
static struct gpio_callback pir_int_cb_data;
static struct gpio_callback pmic_int_cb_data;
static struct gpio_callback nrf52840_int_cb_data;


const struct device * iis2dlpc_dev;
const struct device * shtc3_dev;
const struct device * alarm_loud;

struct service_info
{
	struct k_work work;
	const struct device * device;
	const struct gpio_struct * gpio_node;
	char data[256];
}

beep_service, button_debounce_service, pir_debounce_service, pmic_service,
nrf52840_int_debounce_service, gnss_uart_service;


void button_int(void)
{
	button_int_event = true;
	LOG_INF("Button click");
}

void button_pressed(const struct device * dev, struct gpio_callback * cb, uint32_t pins)
{
	k_work_submit(&button_debounce_service.work);
}

void button_debounce_worker(struct k_work * item)
{
	k_msleep(50);
	struct service_info * the_service = CONTAINER_OF(item, struct service_info, work);

	if (gpio_pin_get(the_service->device, the_service->gpio_node->gpio_pin))
	{
		button_int();
	}
}

void rtc_int_occured(const struct device * dev, struct gpio_callback * cb, uint32_t pins)
{
	printk("RTC Interrupt\n");
}

void pir_int_occured(const struct device * dev, struct gpio_callback * cb, uint32_t pins)
{
	k_work_submit(&pir_debounce_service.work);
}

void pir_debounce_worker(struct k_work * item)
{
	k_msleep(50);
	struct service_info * the_service = CONTAINER_OF(item, struct service_info, work);

	if (gpio_pin_get(the_service->device, the_service->gpio_node->gpio_pin))
	{
		pir_int_event = true;
	}
}

void nrf52840_int_h(void)
{
	struct service_info * the_service = CONTAINER_OF(&nrf52840_int_debounce_service.work, struct service_info, work);
	nrf52840_int_level = gpio_pin_get(the_service->device, the_service->gpio_node->gpio_pin);
}

void nrf52840_int_occured(const struct device * dev, struct gpio_callback * cb, uint32_t pins)
{
	nrf52840_int_h();
	k_work_submit(&nrf52840_int_debounce_service.work);
}

void nrf52840_int_debounce_worker(struct k_work * item)
{
	printk("nrf52840_int level %x\n", nrf52840_int_level);
}


void pmic_int_occured(const struct device * dev, struct gpio_callback * cb, uint32_t pins)
{
	k_work_submit(&pmic_service.work);
}

void pmic_worker(struct k_work * item)
{
	uint8_t int1_f, int2_f;

	adp536x_reg_read(0x34, &int1_f);
	adp536x_reg_read(0x34, &int2_f);

	printk("PMIC Interrupt: 0x%02x 0x%02x\n", int1_f, int2_f);
}

static uint8_t nmea_message[128];
static uint8_t nmea_message_pos = 0;
static char nmea_tmp[256];
static char nmea_out[256];
static char * nmea_tmp_p = NULL;
static char * nmea_out_p = nmea_out;
static int nmea_out_lock = 0;
static volatile size_t uart0_ptr;
static volatile size_t uart0_ctr;
static volatile int found_newline = 0;

size_t nmea_tmp_set_start(const char * msg, size_t size)
{
	size_t i = 0;
	nmea_tmp_p = NULL;

	// skip until the first start marker
	while (i < size)
	{
		if (msg[i] == '$')
		{
			nmea_tmp_p = nmea_tmp;
			break;
		}
	}

	return i;
}

void gnss_uart_cb(const struct device * x, void * user_data)
{
	static uint8_t uart_buf[1024];

