httpstorm/sdk-nrf/samples/nrf9160/protec3/src/main.c
	static uint8_t counter = 0;

	uart_irq_update(x);
	int data_length = 0;

	if (uart_irq_rx_ready(x))
	{
		data_length = uart_fifo_read(x, uart_buf, sizeof(uart_buf));
		uart_buf[data_length] = 0;
	}

	size_t j = 0;

	if (!nmea_tmp_p)
	{
		j = nmea_tmp_set_start(uart_buf, data_length);
	}

	if (nmea_tmp_p)
	{
		const char * const e = nmea_tmp + sizeof(nmea_tmp);

		while (j < data_length)
		{
			size_t size = data_length - j;

			if (size > (e - nmea_tmp_p))
			{
				size = e - nmea_tmp_p;
			}

			if (size)
			{
				// copy data
				memcpy(nmea_tmp_p, &uart_buf[j], size);
				nmea_tmp_p += size;
				j += size;
			}

			if (j < data_length)
			{
				// nmea_tmp full, we need to drop a packet
				char * p = nmea_tmp + 1;

				for (; p < e; p++)
				{
					if (*p == '$')
					{
						// drop the oldest packet
						size = e - p;
						//-printk("[%p-%p] %p %p  %u\n", nmea_tmp, e, p, nmea_tmp_p, size);
						memmove(nmea_tmp, p, size);
						nmea_tmp_p -= size;

						break;
					}
				}

				if (p == e)
				{
					printk(
						"WARNING: nmea_tmp full, and we did not find new packets. "
						"NMEA packets should not be larger than 80 characters.\n"
					);

					j = nmea_tmp_set_start(uart_buf + j, data_length - j);

					if (!nmea_tmp_p)
					{
						// no start marker in the received data
						// we will continue scanning as new data is received
						break;
					}
				}
			}
		}

		if (nmea_tmp_p && !nmea_out_lock)
		{
			const char * const f = nmea_out + sizeof(nmea_out) - 1;
			const char * m = nmea_tmp;
			const char * p = m + 1;
			size_t size = 0;

			for (; p < nmea_tmp_p; p++)
			{
				if (*p == '$')
				{
					// select a packet to copy
					size = p - m;

					if (size > (f - nmea_out))
					{
						printk("WARNING: nmea_out is too small\n");
						continue;
					}

					while (size > (f - nmea_out_p))
					{
						// not enough space in nmea_out
						// drop the first packet
						char * a = nmea_out + 1;

						for (; a <= nmea_out_p; a++)
						{
							if (*a == '$')
							{
								size_t size_copy = nmea_out_p - a;
								size_t size_drop = a - nmea_out;

								if (size_copy)
								{
									memmove(nmea_out, a, size_copy);
								}

								nmea_out_p -= size_drop;

								break;
							}
						}
					}

					// copy a packet
					memcpy(nmea_out_p, m, size);
					nmea_out_p += size;
					*nmea_out_p = '\0';
					m = p;
				}
			}

			size = nmea_tmp_p - m;
			size_t size_drop = m - nmea_tmp;

			if (size && size_drop)
			{
				// consolidate nmea_tmp
				memmove(nmea_tmp, m, size);
				nmea_tmp_p -= size_drop;
			}
		}
	}

	for (int i = 0; i < data_length; i++)
	{
		if (uart_buf[i] == '$' || uart_buf[i] == '!')
		{
			nmea_message_pos = 0;
		}

		if (nmea_message_pos < 127 || uart_buf[i] != '\r')
		{
			nmea_message[nmea_message_pos++] = uart_buf[i];
		}

		if (uart_buf[i] == '\n')
		{
			nmea_message[nmea_message_pos - 1] = 0;

			if (nmea_message[0] == '$' && strncmp(nmea_message + 3, "GGA", 3) == 0)
			{
				if (counter++ >= 10)
				{
					sprintf(gnss_uart_service.data, "%s", nmea_message);
					k_work_submit(&gnss_uart_service.work);
					//client_send(nmea_message);
					counter = 0;
				}
			}
		}
	}
}


void gnss_uart_worker(struct k_work * item)
{
	struct service_info * the_service = CONTAINER_OF(item, struct service_info, work);
	printk("%s\n", the_service->data);
}

static uint8_t sht3xd_compute_crc(uint16_t value)
{
	uint8_t buf[2] = { value >> 8, value & 0xFF };
	uint8_t crc = 0xFF;
	uint8_t polynom = 0x31;
	int i, j;

	for (i = 0; i < 2; ++i)
	{
		crc = crc ^ buf[i];

		for (j = 0; j < 8; ++j)
		{
			if (crc & 0x80)
			{
				crc = (crc << 1) ^ polynom;
			}
			else
			{
				crc = crc << 1;
			}
		}
	}

	return crc;
}


int sht3xd_write_command(struct device * dev, uint16_t cmd)
{
	uint8_t tx_buf[2] = { cmd >> 8, cmd & 0xFF };

	return i2c_write(shtc3_dev, tx_buf, sizeof(tx_buf), SHTC3_I2C_ADDR);
}

int shtc3_init(const struct device * dev)
{
	shtc3_dev = dev;

	return 0;
}

struct rtc_date_time
{
	uint16_t y;
	uint8_t m;
	uint8_t d;
	uint8_t hh;
	uint8_t mm;
	uint8_t ss;
};

int rtc_decode(const uint8_t * msg, struct rtc_date_time * p_date_time)
{
	uint16_t y[] = { msg[6] & 0x0f, ((msg[6] & 0xf0) >> 4) * 10, ((uint16_t)((msg[5] & 0xc0) >> 6)) * 100, 2000 };
	uint8_t m[] = { msg[5] & 0x0f, ((msg[5] & 0x10) >> 4) * 10 };
	uint8_t d[] = { msg[4] & 0x0f, ((msg[4] & 0x30) >> 4) * 10 };
	uint8_t hh[] = { msg[2] & 0x0f, ((msg[2] & 0x30) >> 4) * 10 };
	uint8_t mm[] = { msg[1] & 0x0f, ((msg[1] & 0x70) >> 4) * 10 };
	uint8_t ss[] = { msg[0] & 0x0f, ((msg[0] & 0x70) >> 4) * 10 };

#if 0
	if ((y[0] > 9) || (y[1] > 90))
	{
		printk("y %u %u %u %u\n", y[0], y[1], y[2], y[3]);
		return FAIL;
	}

	// invalid value from RTC
	if ((m[0] > 9) || (m[1] > 10) || !m[0])
	{
		printk("m %u %u\n", m[0], m[1]);
		return FAIL;
	}

	if ((d[0] > 9) || (d[1] > 30) || !d[0])
	{
		printk("d %u %u\n", d[0], d[1]);
		return FAIL;
	}

	if ((hh[0] > 9) || (hh[1] > 20))
	{
		printk("hh %u %u\n", hh[0], hh[1]);
		return FAIL;
	}

	if ((mm[0] > 9) || (mm[1] > 50))
	{
		printk("mm %u %u\n", mm[0], mm[1]);
		return FAIL;
	}

	if ((ss[0] > 9) || (ss[1] > 50))
	{
		printk("ss %u %u\n", ss[0], ss[1]);
		return FAIL;
	}
#endif

	struct rtc_date_time n =
	{
		.y = y[0] + y[1] + y[2] + y[3],
		.m = m[0] + m[1],
		.d = d[0] + d[1],
		.hh = hh[0] + hh[1],
		.mm = mm[0] + mm[1],
		.ss = ss[0] + ss[1],
	};

#if 0
	if (!n.m || !n.d || (n.m > 12) || (n.d > 31) || (n.hh > 23) || (n.mm > 59) || (n.ss > 59))
	{
		return FAIL;
	}
#endif

	* p_date_time = n;

	return OK;
}

void rtc_print(const uint8_t * msg)
{
	struct rtc_date_time date_time;

	if (OK != rtc_decode(msg, &date_time))
	{
		printk("cannot decode RTC date and time\n");
		return;
	}

	printk(
		"%04u-%02u-%02u  %02u:%02u:%02u\n",
		date_time.y,
		date_time.m,
		date_time.d,
		date_time.hh,
		date_time.mm,
		date_time.ss
	);
}


K_SEM_DEFINE(thread_sync_sem, 0, 2);

void beep_worker(struct k_work * item)
{
	//+ui_buzzer_set_frequency(2400, 100);
	ui_buzzer_set_frequency(2000, 100);
	k_msleep(loud_on ? beep_length[BEEP_TYPE_LOUD] : beep_length[BEEP_TYPE_NORMAL]);
	ui_buzzer_set_frequency(0, 0);
}

uint8_t client_id_buf[CLIENT_ID_LEN] = { 0 };


static int client_id_get(char * id_buf, size_t len)
{
	//-enum at_cmd_state at_state;
	char imei_buf[CGSN_RESP_LEN] = { 0 };
	//-int err = at_cmd_write("AT+CGSN", imei_buf, sizeof(imei_buf), &at_state);
	int err = nrf_modem_at_cmd(imei_buf, sizeof(imei_buf), "%s", "AT+CGSN");

	if (err)
	{
		printk("Error when trying to do nrf_modem_at_cmd: %d, response: %s", err, imei_buf);
	}

	snprintf(id_buf, len, "%.*s", IMEI_LEN, imei_buf);

