httpstorm/sdk-nrf/samples/nrf9160/protec3/src/main.c
	return 0;
}

#if 0
/*
 * retrieves the ICCID of the inserted SIM card
 * modem must be in normal mode
 */
static int iccid_get(char * id_buf, size_t len)
{
	//-enum at_cmd_state at_state;
	char * final_doublequote;
	int i;
	char tmp;
	char iccid_buf[ICCID_BUF_LEN] = { 0 };
	int err = nrf_modem_at_cmd(iccid_buf, sizeof(iccid_buf), "%s", "AT+CRSM=176,12258,0,0,10");
	//int err = nrf_modem_at_cmd(iccid_buf, sizeof(iccid_buf), "%s", "AT%XICCID");
	//-int err = at_cmd_write("AT+CRSM=176,12258,0,0,10", iccid_buf, sizeof(iccid_buf), &at_state);
	//int err = at_cmd_write("AT%XICCID", iccid_buf, sizeof(iccid_buf), &at_state);

	if (err)
	{
		printk("Error when trying to do nrf_modem_at_cmd: %d, response: %s", err, iccid_buf);
		return -1;
	}

	//В Format of answer:
	// +CRSM: 144,0,"<ICCID, up to 22 digits>"

	// first get rid of final double quote
	final_doublequote = strstr(iccid_buf + 14, "\"");

	if (final_doublequote)
	{
		*final_doublequote = '\0';
	}

	strncpy(id_buf, iccid_buf + 14, len);

	// The retrieved ICCID is in little endian order, let's fix it
	len = strlen(id_buf);

	for (i = 0; i < len; i += 2)
	{
		tmp = id_buf[i + 1];
		id_buf[i + 1] = id_buf[i];
		id_buf[i] = tmp;
	}

	return 0;
}
#endif

enum FOTA_UPDATE_STATUS
{
	FOTA_UPDATE_STATUS_NORMAL = 0,
	FOTA_UPDATE_STATUS_NOTIFY = 1,
};

// notify the system after reboot that the firmware has been upgraded
void fota_update_notify(void)
{
	uint8_t update_status = FOTA_UPDATE_STATUS_NOTIFY;
	int err = eeprom_write(eeprom_dev, EEPROM_ADDRESS_UPDATE_STATUS, &update_status, sizeof(update_status));

	if (OK != err)
	{
		printk("fota_update_notify()  EEPROM write failed\n");
	}
}

// checks whether we have started for the first time after update
void fota_update_complete(void)
{
	uint8_t update_status = FOTA_UPDATE_STATUS_NORMAL;
	int err = eeprom_read(eeprom_dev, EEPROM_ADDRESS_UPDATE_STATUS, &update_status, sizeof(update_status));

	if (OK == err)
	{
		if (update_status == FOTA_UPDATE_STATUS_NOTIFY)
		{
			char msg[] = "update_status={\"status\": \"ready\"}\n";
			uart_fota_send(msg, sizeof(msg) - 1);
			//?boot_request_upgrade(BOOT_UPGRADE_PERMANENT);

			// clear the update status
			update_status = FOTA_UPDATE_STATUS_NORMAL;
			err = eeprom_write(eeprom_dev, EEPROM_ADDRESS_UPDATE_STATUS, &update_status, sizeof(update_status));

			if (OK != err)
			{
				printk("fota_update_complete()  EEPROM write failed\n");
			}
		}
	}
	else
	{
		printk("fota_update_complete()  EEPROM read failed\n");
	}
}

#define ALARM_ACTIVE_PERIODE 600

int main(void)
{
	size_t size = 0;
	int32_t alarm_periode = 0;
	uint8_t alarm_old = alarm_arm;
	uint8_t loud_old = loud_on;

	const struct device * gnss_uart_dev;
	const struct device * button;
	const struct device * gps_en;
	const struct device * rtc_dev;
	const struct device * rtc_int;
	const struct device * pir_int;
	const struct device * i2c2_dev;
	const struct device * pmic_int;
	const struct device * nrf52840_int;

	int adp_err, err;
	bool apn_valid = false;

	union startup_counter_union
	{
		uint32_t value;
		uint8_t buffer[4];
	};

#if 0
	// switch to normal mode to get ICCID
	lte_lc_normal();

	err = iccid_get(msg, sizeof(msg));

	// power of mode again, otherwise lte_lc_link will fail
	lte_lc_power_off();
#endif

	printk("*** Firmware build    " __DATE__ "  " __TIME__ "\n");

	union startup_counter_union startup_counter;
	eeprom_dev = EEPROM0_DEVICE;

	if (eeprom_dev)
	{
		printk("EEPROM device %s initialized successfully\n", "eeprom0");
		err = eeprom_read(eeprom_dev, 0, startup_counter.buffer, sizeof(uint32_t));
		printk("Startup counter is: %d\n", startup_counter.value);
		startup_counter.value++;
		eeprom_write(eeprom_dev, 0, startup_counter.buffer, sizeof(uint32_t));

		// notify if this is the first boot after a firmware upgrade
		fota_update_complete();

		// read APN config from EEPROM
		apn_valid = apn_read(&apn_config, msg);
	}

#ifdef CONFIG_UPDATE_FILE
	uart0_dev = DEVICE_DT_GET(DT_NODELABEL(uart0));
	uart0_ptr = 0;
	uart0_ctr = 0;
	my_uart_init(uart0_dev);
#endif

	fota_uart_init(uart_fota_recv, uart_fota_send);

	k_work_init(&beep_service.work, beep_worker);
	k_work_init(&button_debounce_service.work, button_debounce_worker);
	k_work_init(&pir_debounce_service.work, pir_debounce_worker);
	k_work_init(&pmic_service.work, pmic_worker);
	k_work_init(&gnss_uart_service.work, gnss_uart_worker);
	k_work_init(&nrf52840_int_debounce_service.work, nrf52840_int_debounce_worker);


	alarm_loud = pin_init(&alarm_loud_node);
	gps_en = pin_init(&gps_en_node);

	button = pin_int_init(&button_node, &button_cb_data, button_pressed, 0);
	button_debounce_service.device = button;
	button_debounce_service.gpio_node = &button_node;

	rtc_int = pin_int_init(&rtc_node, &rtc_int_cb_data, rtc_int_occured, 0);

	pir_int = pin_int_init(&pir_node, &pir_int_cb_data, pir_int_occured, 0);
	pir_debounce_service.device = pir_int;
	pir_debounce_service.gpio_node = &pir_node;

	pmic_int = pin_int_init(&pmic_node, &pmic_int_cb_data, pmic_int_occured, 0);
	pmic_service.device = pmic_int;
	pmic_service.gpio_node = &pmic_node;

	nrf52840_int = pin_int_init(&nrf52840_int_node, &nrf52840_int_cb_data, nrf52840_int_occured, GPIO_INT_EDGE_BOTH);
	nrf52840_int_debounce_service.device = nrf52840_int;
	nrf52840_int_debounce_service.gpio_node = &nrf52840_int_node;
	nrf52840_int_h();


	fota_dl_init();

	if (button_int_event || gpio_pin_get(button, button_node.gpio_pin))
	{
		button_int_event = false;

		// TODO: create a dedicated task to check for updates
		fota_dl_trigger();
	}

	adp_err = adp536x_init(I2C_BUS_2_DEV);

	if (adp_err)
	{
		printk("ADP536X failed to initialize, error: %d\n", adp_err);
	}
	else
	{
		printk("ADP536X initialized successfully\n");
	};

	gnss_uart_dev = UART_DEVICE;

	if (gnss_uart_dev)
	{
		printk("Uart %s initialized successfully\n", "uart1");

		uart_irq_callback_set(gnss_uart_dev, gnss_uart_cb);
		uart_irq_rx_enable(gnss_uart_dev);

		gnss_uart_service.device = gnss_uart_dev;
	}
	else
	{
		printk("Error initialzing uart %s\n", "uart1");
	}

	/*uart0_dev = device_get_binding(DT_LABEL(DT_NODELABEL(uart0)));
	uart_irq_rx_enable(uart0_dev);*/

	err = shtc3_init(I2C_BUS_2_DEV);

	if (err)
	{
		printk("SHTC3 sensor failed to initialize, error: %d\n", err);
	}
	else
	{
		printk("SHTC3 sensor initialized successfully\n");

		uint8_t rx_buf[3];
		uint8_t tx_buf[2] = { 0xef, 0xc8 };

		if (i2c_write_read(shtc3_dev, SHTC3_I2C_ADDR, tx_buf, sizeof(tx_buf),
			rx_buf, sizeof(rx_buf)) < 0)
		{
			printk("SHTC3 Failed to read data sample!\n");
		}
		else
		{
			printk("SHTC3 device id: 0x%02x 0x%02x 0x%02x -> 0x%02x\n", rx_buf[0], rx_buf[1], rx_buf[2], sht3xd_compute_crc((rx_buf[0] << 8) + rx_buf[1]));
		}
	}

	rtc_dev = RTC_I2C_DEV;

	if (rtc_dev)
	{
		printk("RTC on %s bus initialized successfully\n", "i2c3");

		uint8_t rx_buf[8];
		uint8_t tx_buf[1] = { 0 };

		if (i2c_write_read(rtc_dev, RTC_I2C_ADDR, tx_buf, sizeof(tx_buf), rx_buf, sizeof(rx_buf)) < 0)
		{
			printk("RTC Failed to read data sample!\n");
		}
		else
		{
			for (int i = 0; i < 8; i++)
			{
				printk("RTC reg: 0x%02x -> 0x%02x\n", i, rx_buf[i]);
			}

			rtc_print(rx_buf);
		}


