httpstorm/sdk-nrf/samples/nrf9160/protec3/src/main.c
	}
	else
	{
		printk("Error initializing RTC on %s\n", "i2c3");

	}

	client_id_get(client_id_buf, sizeof(client_id_buf));

	printk("Client id: %s\n", client_id_buf);


	i2c2_dev = I2C_BUS_2_DEV;

	if (i2c2_dev)
	{
		iis2dlpc_dev = i2c2_dev;
		iis2dlpc_init_api(iis2dlpc_dev);
	}

	//-bme280_init_api(i2c2_dev);
	shtc3_init_api(shtc3_dev);


	if (ui_buzzer_init() == 0)
	{
		printk("Buzzer initialized in silent mode\n");
	}
	else
	{
		printk("Buzzer initialization failed\n");
	}

	k_sem_give(&thread_sync_sem);
	k_sem_give(&thread_sync_sem);

	while (1)
	{
#if 1
#if CONFIG_NETWORKING
		size = 0;
#endif

		k_msleep(1);

		if (button_int_event || pir_int_event)
		{
			printk(
				"protec3_events={\"alarm\": %u, \"PIR\": %u}\n",
				button_int_event,
				pir_int_event
			);

#if CONFIG_NETWORKING
			size += snprintf(
				msg + size,
				sizeof(msg) - size,
				"protec3_events={\"alarm\": %u, \"PIR\": %u}\n",
				button_int_event,
				pir_int_event
			);
#endif
		}

		if (pir_int_event)
		{
			printk("PIR Sensor Interrupt\n");
			pir_int_event = false;
			alarm_periode = ALARM_ACTIVE_PERIODE;
		}

		if (button_int_event)
		{
			mqtt_pub_btn_press();

			if (alarm_arm)
			{
				if (loud_on)
				{
					alarm_arm = MQTT_REQUEST_OFF;
					loud_on = false;
				}
				else
				{
					loud_on = true;

#if 0
					/***************** SMS ***********************/
					printk("send_sms() ...\n");
					char sms[256];
					memset(sms, 0, sizeof(sms));
					err = send_sms("4917686281431", "Protec3", sms, sizeof(sms));
					printk("send_sms: %i\n\n", err);
					/***************** END SMS *******************/
#endif
				}
			}
			else
			{
				alarm_arm = MQTT_REQUEST_ON;
			}

			button_int_event = false;
		}

		if ((alarm_old != alarm_arm) || (loud_old != loud_on))
		{
			alarm_old = alarm_arm;
			loud_old = loud_on;
			gpio_pin_set(gps_en, gps_en_node.gpio_pin, alarm_arm);
			gpio_pin_set(alarm_loud, alarm_loud_node.gpio_pin, loud_on);
			i2c_reg_write_byte(rtc_dev, RTC_I2C_ADDR, 0x07, alarm_arm ? 0x80 : 0x00);
			k_work_submit(&beep_service.work);
			tcp_connect_disconnect(alarm_arm);
		}

		if (alarm_arm && (loud_on || alarm_periode))
		{
			uint8_t rx_buf[8];
			uint8_t tx_buf[1] = { 0 };

			if (i2c_write_read(rtc_dev, RTC_I2C_ADDR, tx_buf, sizeof(tx_buf), rx_buf, sizeof(rx_buf)) < 0)
			{
				printk("RTC Failed to read data sample!\n");
			}
			else
			{
				for (int i = 7; i < 8; i++)
				{
					printk("RTC reg: 0x%02x -> 0x%02x\n", i, rx_buf[i]);
				}

				rtc_print(rx_buf);
				struct rtc_date_time date_time;

				if (OK == rtc_decode(rx_buf, &date_time))
				{
					printk(
						"rtc={\"y\": %u, \"m\": %u, \"d\": %u, \"hh\": %u, \"mm\": %u, \"ss\": %u}\n",
						date_time.y,
						date_time.m,
						date_time.d,
						date_time.hh,
						date_time.mm,
						date_time.ss
					);

#if CONFIG_NETWORKING
					size += snprintf(
						msg + size,
						sizeof(msg) - size,
						"rtc={\"y\": %u, \"m\": %u, \"d\": %u, \"hh\": %u, \"mm\": %u, \"ss\": %u}\n",
						date_time.y,
						date_time.m,
						date_time.d,
						date_time.hh,
						date_time.mm,
						date_time.ss
					);
#endif
				}
			}

			if (!adp_err)
			{
				err = 0;

				uint8_t
					cs1 = 0,
					cs2 = 0,
					soc = 0,
					vbh = 0,
					vbl = 0,
					pgs = 0;

				if (adp536x_reg_read(0x08, &cs1) > 0) { err += 1; }
				if (adp536x_reg_read(0x09, &cs2) > 0) { err += 2; }
				if (adp536x_reg_read(0x21, &soc) > 0) { err += 4; }
				if (adp536x_reg_read(0x25, &vbh) > 0) { err += 8; }
				if (adp536x_reg_read(0x26, &vbl) > 0) { err += 16; }
				if (adp536x_reg_read(0x2f, &pgs) > 0) { err += 32; }

				if (!err)
				{
					uint16_t vb = (vbh << 5) | (vbl >> 3);

					printk(
						"adp536x={\"cs1\": \"0x%02x\", \"cs2\": \"0x%02x\", \"pgs\": \"0x%02x\", \"voltage\": %04d, \"level\": %d}\n",
						cs1,
						cs2,
						pgs,
						vb,
						soc
					);

#if CONFIG_NETWORKING
					size += snprintf(
						msg + size,
						sizeof(msg) - size,
						"adp536x={\"cs1\": \"0x%02x\", \"cs2\": \"0x%02x\", \"pgs\": \"0x%02x\", \"voltage\": %04d, \"level\": %d}\n",
						cs1,
						cs2,
						pgs,
						vb,
						soc
					);

#if MQTT_SIZE
					snprintf(mqtt, sizeof(mqtt), "%02x", pgs);
					mqtt_pub("/battery/status", mqtt);

					snprintf(mqtt, sizeof(mqtt), "%04d", vb);
					mqtt_pub("/battery/voltage", mqtt);
#endif
#endif
				}
			}

			struct shtc3_t shtc3;
			err = shtc3_read(shtc3_dev, &shtc3);

			if (OK == err)
			{
				printf("shtc3={\"temp\": %.3f, \"humidity\": %.3f}\n", shtc3.temperature, shtc3.humidity);

#if CONFIG_NETWORKING
				size += snprintf(
					msg + size,
					sizeof(msg) - size,
					"shtc3={\"temp\": %.3f, \"humidity\": %.3f}\n",
					shtc3.temperature,
					shtc3.humidity
				);

#if MQTT_SIZE
				snprintf(mqtt, sizeof(mqtt), "%.3f", shtc3.temperature);
				mqtt_pub("/temperature", mqtt);
#endif
#endif
			}

			// IIS2DLPC read XYZ
			struct iis2dlpc_t iis2dlpc;
			err = iis2dlpc_read(iis2dlpc_dev, &iis2dlpc);

			if (OK == err)
			{
				printk(
					"iis2dlpc={\"x\": %.3f, \"y\": %.3f, \"z\": %.3f}\n",
					((float)(iis2dlpc.x)) * 0.001,
					((float)(iis2dlpc.y)) * 0.001,
					((float)(iis2dlpc.z)) * 0.001
				);

#if CONFIG_NETWORKING
				size += snprintf(
					msg + size,
					sizeof(msg) - size,
					"iis2dlpc={\"x\": %.3f, \"y\": %.3f, \"z\": %.3f}\n",
					((float)(iis2dlpc.x)) * 0.001,
					((float)(iis2dlpc.y)) * 0.001,
					((float)(iis2dlpc.z)) * 0.001
				);

#if MQTT_SIZE
				snprintf(
					mqtt,
					sizeof(mqtt),
					"%.3f,%.3f,%.3f",
					((float)(iis2dlpc.x)) * 0.001,
					((float)(iis2dlpc.y)) * 0.001,
					((float)(iis2dlpc.z)) * 0.001
				);

				mqtt_pub("/accelerometer", mqtt);
#endif
#endif
			}



#if CONFIG_NETWORKING
			nmea_out_lock = true;

			if (nmea_out_p - nmea_out)
			{
				size += snprintf(
					msg + size,
					sizeof(msg) - size,
					"%s",
					nmea_out
				);

#if MQTT_SIZE
				snprintf(mqtt, sizeof(mqtt), "%s", nmea_out);
#endif

				nmea_out_p = nmea_out;
			}

			nmea_out_lock = false;

#if MQTT_SIZE
			mqtt_pub("/gnss/raw", mqtt);
#endif

