httpstorm/sdk-nrf/samples/nrf9160/protec3/src/main.c
			if (size)
			{
				if (size > (sizeof(msg) - 1))
				{

					LOG_ERR("msg out of range %u %u", size, sizeof(msg));
					size = sizeof(msg) - 1;
				}

				lte_send(msg, size);
			}
#endif
		}
#if CONFIG_NETWORKING
		else if (size)
		{
			if (size > (sizeof(msg) - 1))
			{
				LOG_ERR("msg out of range %u %u", size, sizeof(msg));
				size = sizeof(msg) - 1;
			}

			lte_send(msg, size);
		}
#endif

		int w = 1000;
		int32_t sleep_time = loud_on ? 1 : 60;

		while (
			!button_int_event &&
			(alarm_old == alarm_arm) &&
			!(pir_int_event && !alarm_periode)
			&& w--
			)
		{
			k_msleep(sleep_time);
		}

		if (alarm_periode > sleep_time)
		{
			alarm_periode -= sleep_time;
		}
		else
		{
			alarm_periode = 0;
		}

#else
		k_msleep(1);

		if (pir_int_event)
		{
			printk("PIR Sensor Interrupt\n");
			pir_int_event = false;
		}

		if (button_int_event)
		{
			if (alarm_arm)
			{
				if (loud_on)
				{
					loud_on = false;
					gpio_pin_set(alarm_loud, alarm_loud_node.gpio_pin, 0);

					alarm_arm = false;

					i2c_reg_write_byte(rtc_dev, RTC_I2C_ADDR, 0x07, 0x00);
				}
				else
				{
					loud_on = true;
					gpio_pin_set(alarm_loud, alarm_loud_node.gpio_pin, 1);

					gpio_pin_set(gps_en, gps_en_node.gpio_pin, 0);

				}

			}
			else
			{
				alarm_arm = true;
				gpio_pin_set(gps_en, gps_en_node.gpio_pin, 1);
				i2c_reg_write_byte(rtc_dev, RTC_I2C_ADDR, 0x07, 0x80);
			}

			k_work_submit(&beep_service.work);

			uint8_t rx_buf[8];
			uint8_t tx_buf[1] = { 0 };

			if (i2c_write_read(rtc_dev, RTC_I2C_ADDR, tx_buf, sizeof(tx_buf), rx_buf, sizeof(rx_buf)) < 0)
			{
				printk("RTC Failed to read data sample!\n");
			}
			else
			{
				for (int i = 7; i < 8; i++)
				{
					printk("RTC reg: 0x%02x -> 0x%02x\n", i, rx_buf[i]);
				}

				rtc_print(rx_buf);
			}

			if (!adp_err)
			{
				err = 0;

				uint8_t
					cs1 = 0,
					cs2 = 0,
					soc = 0,
					vbh = 0,
					vbl = 0,
					pgs = 0;

				if (adp536x_reg_read(0x08, &cs1) > 0) { err += 1; }
				if (adp536x_reg_read(0x09, &cs2) > 0) { err += 2; }
				if (adp536x_reg_read(0x21, &soc) > 0) { err += 4; }
				if (adp536x_reg_read(0x25, &vbh) > 0) { err += 8; }
				if (adp536x_reg_read(0x26, &vbl) > 0) { err += 16; }
				if (adp536x_reg_read(0x2f, &pgs) > 0) { err += 32; }

				if (!err)
				{
					uint16_t vb = (vbh << 5) | (vbl >> 3);
					printk("adp536x status: 0x%02x, 0x%02x, 0x%02x, %04d mV, %d%%\n", cs1, cs2, pgs, vb, soc);
				}
			}

			button_int_event = false;
		}
#endif
	}

	return 0;
}

static void gray_thread()
{
	const struct gpio_struct leds[3] =
	{
		  PIN_OUTPUT(led0),
		  PIN_OUTPUT(led1),
		  PIN_OUTPUT(led2),
	};

	const struct device * led_dev[3];

	k_sem_take(&thread_sync_sem, K_FOREVER);

	for (int i = 0; i < 3; i++)
	{
		led_dev[i] = pin_init(&leds[i]);
	}

	static uint8_t gray_code[8] = { 0, 1, 3, 2, 6, 7, 5, 4 };
	int position = 0;
	printk("LED drivers initialized successfully\n");

	while (1)
	{
		if (alarm_arm)
		{
			for (int i = 0; i < 3; i++)
			{
				gpio_pin_set(led_dev[i], leds[i].gpio_pin, ((gray_code[position] & (1 << i)) ? 1 : 0));

			}

			position++;

			if (position > 7)
			{
				position = 0;
			}

			k_msleep(1000);
		}
		else
		{
			if (position != 0)
			{
				for (int i = 0; i < 3; i++)
				{
					gpio_pin_set(led_dev[i], leds[i].gpio_pin, 0);
				}

				position = 0;
			}

			k_msleep(100);
		}
	};

}

int set_beep_time(enum BEEP_TYPE type, uint16_t length)
{
	if ((BEEP_TIME_MAX < length) || (BEEP_TYPE_INVALID <= type))
	{
		return FAIL;
	}

	beep_length[type] = length;

	return OK;
}

uint16_t get_beep_time(enum BEEP_TYPE type)
{
	if (BEEP_TYPE_INVALID > type)
	{
		return beep_length[type];
	}
	else
	{
		return 0;
	}
}

K_THREAD_DEFINE(gray_thread_id, 1024, gray_thread, NULL, NULL, NULL, 7, 0, 0);
